# A First Example

harry, ron - values
wizard - predicate

?- - prolog prompt
. - stop


```
wizard(harry). <- knowledge base
wizard(ron).

?- wizard(harry)
 - true

?- wizard(draco)
 - false

?- wizard(X)
 X = harry ; <- ; asks system if theres a next true value
 X = ron.

```

```
wizard(harry).
muggle(uncle_vernon).
father(harry,uncle_vernon).

?- father(harry,X)
 x = uncle_vernon.

?- father(X,X)
 - false

?- father(X,Y)
 X = harry ;
 Y = uncle_vernon.
```

## knowledge base syntax

```
wizard(X) :- father(X,Y), wizard(Y), ... <- needs all to be true
```

## atoms and variables

atoms start always with small letters or special characters
variables start always with big letters or underscore

## predicates
